/*
 * 第85题：给定浮点格式，有k位指数和n位小数，对于以下数
 * 写出阶码E，尾数M，小数f，和值V的公式
 * 1. 7.0
 * 2. 能够被准确描述的最大奇数
 * 3. 最小的格式化数的倒数
*/

/*
 * 解答：
 * 1. 
 * 偏置bias = 2^(k-1) - 1
 * 值V = 2^E * M
 * 7.0 = 111.000 = 1.11 << 2
 * 阶码E = 2 = e - bias ---> e = E + bias = 1 + 2^(k-1)
 * 尾数M = 1 + f = 1 + 0.11
 * 
 * 2.
 * 能够描述的最大的奇整数的位应该是111111......
 * 而浮点数表示为1.111111...*2^n的样式，小数点后边应该有n个1 得到这些，我们就能计算出该浮点数的二进制表示
 * 因此最大的奇整数位11111... 有n+1个1 也就是2^(n+1) - 1
 * E = n  ==> e = E + bias = n + bias
 * ==> 0 n + bias 11111...
 * 
 * 3.
 * 最小的规格化数是小数为0x0，阶码为0x1-bias
 * 所以V = 2^(1-bias)*1    -> 倒数为 2^(bias - 1)
*/