/*
 * 第90题：编写c函数来实现计算2^x的浮点表示
 * 当x太小时，直接返回0，当x太大时，返回正无穷
*/

float fpwr2(int x)
{
    unsigned exp, frac;
    unsigned u;

    if (x < -149)
    {
        //过小
        //0 00000000 00000...001  ==> 2^-23 * 2^(1-bias) = 2^-23 * 2^(1-(2^7 - 1))
        exp = 0;
        frac = 0;
    }
    else if (x < -126)
    {
        //非规格化
        //0 00000001 00000...000 ---> E = 1 - 2^7 + 1 = 2 - 2^7 = -126
        exp = 0;
        frac = 1 << (149 + x);
    }
    else if (x < 128)
    {
        //规格化
        exp = x + 127;
        frac = 0;
    }
    else
    {
        //过大
        exp = 0xff;
        frac = 0;
    }
}